/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const __BITS_PER_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const IPSET_PROTOCOL: u32 = 7;
pub const IPSET_PROTOCOL_MIN: u32 = 6;
pub const IPSET_MAXNAMELEN: u32 = 32;
pub const IPSET_MAX_COMMENT_SIZE: u32 = 255;
pub const IPSET_INVALID_ID: u32 = 65535;
pub const SO_IP_SET: u32 = 83;
pub const IP_SET_OP_GET_BYNAME: u32 = 6;
pub const IP_SET_OP_GET_BYINDEX: u32 = 7;

pub const IPV6_RECVHOPLIMIT: u32 = 51;
pub const IPV6_HOPLIMIT: u32 = 52;
pub const IPV6_RECVHOPOPTS: u32 = 53;
pub const IPV6_HOPOPTS: u32 = 54;
pub const IPV6_RTHDRDSTOPTS: u32 = 55;
pub const IPV6_RECVRTHDR: u32 = 56;
pub const IPV6_RTHDR: u32 = 57;
pub const IPV6_RECVDSTOPTS: u32 = 58;
pub const IPV6_DSTOPTS: u32 = 59;
pub const IPV6_RECVPATHMTU: u32 = 60;
pub const IPV6_PATHMTU: u32 = 61;
pub const IPV6_DONTFRAG: u32 = 62;
pub const IPV6_RECVTCLASS: u32 = 66;
pub const IPV6_TCLASS: u32 = 67;
pub const IPV6_AUTOFLOWLABEL: u32 = 70;
pub const IPV6_ADDR_PREFERENCES: u32 = 72;
pub const IPV6_MINHOPCOUNT: u32 = 73;
pub const IPV6_ORIGDSTADDR: u32 = 74;
pub const IPV6_RECVORIGDSTADDR: u32 = 74;
pub const IPV6_TRANSPARENT: u32 = 75;
pub const IPV6_UNICAST_IF: u32 = 76;
pub const IPV6_RECVFRAGSIZE: u32 = 77;
pub const IPV6_FREEBIND: u32 = 78;
pub const IPV6_ADD_MEMBERSHIP: u32 = 20;
pub const IPV6_DROP_MEMBERSHIP: u32 = 21;
pub const IPV6_RXHOPOPTS: u32 = 54;
pub const IPV6_RXDSTOPTS: u32 = 59;
pub const IPV6_PMTUDISC_DONT: u32 = 0;
pub const IPV6_PMTUDISC_WANT: u32 = 1;
pub const IPV6_PMTUDISC_DO: u32 = 2;
pub const IPV6_PMTUDISC_PROBE: u32 = 3;
pub const IPV6_PMTUDISC_INTERFACE: u32 = 4;
pub const IPV6_PMTUDISC_OMIT: u32 = 5;
pub const SOL_IPV6: u32 = 41;
pub const SOL_ICMPV6: u32 = 58;
pub const IPV6_RTHDR_LOOSE: u32 = 0;
pub const IPV6_RTHDR_STRICT: u32 = 1;
pub const IPV6_RTHDR_TYPE_0: u32 = 0;
pub const IN_CLASSA_NET: u32 = 4278190080;
pub const IN_CLASSA_NSHIFT: u32 = 24;
pub const IN_CLASSA_HOST: u32 = 16777215;
pub const IN_CLASSA_MAX: u32 = 128;
pub const IN_CLASSB_NET: u32 = 4294901760;
pub const IN_CLASSB_NSHIFT: u32 = 16;
pub const IN_CLASSB_HOST: u32 = 65535;
pub const IN_CLASSB_MAX: u32 = 65536;
pub const IN_CLASSC_NET: u32 = 4294967040;
pub const IN_CLASSC_NSHIFT: u32 = 8;
pub const IN_CLASSC_HOST: u32 = 255;
pub const IN_LOOPBACKNET: u32 = 127;
pub const INET_ADDRSTRLEN: u32 = 16;
pub const INET6_ADDRSTRLEN: u32 = 46;
pub const IPSET_FLAGS_ALL: i32 = -1;
pub const IPSET_CIDR_SEPARATOR: &[u8; 2] = b"/\0";
pub const IPSET_RANGE_SEPARATOR: &[u8; 2] = b"-\0";
pub const IPSET_ELEM_SEPARATOR: &[u8; 2] = b",\0";
pub const IPSET_NAME_SEPARATOR: &[u8; 2] = b",\0";
pub const IPSET_PROTO_SEPARATOR: &[u8; 2] = b":\0";
pub const IPSET_ESCAPE_START: &[u8; 2] = b"[\0";
pub const IPSET_ESCAPE_END: &[u8; 2] = b"]\0";
pub const IPSET_DIM_UMAX: u32 = 3;
pub const IPSET_OPTARG_MAX: u32 = 24;
pub const IPSET_CMD_ALIASES: u32 = 3;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
pub const ipset_cmd_IPSET_CMD_NONE: ipset_cmd = 0;
pub const ipset_cmd_IPSET_CMD_PROTOCOL: ipset_cmd = 1;
pub const ipset_cmd_IPSET_CMD_CREATE: ipset_cmd = 2;
pub const ipset_cmd_IPSET_CMD_DESTROY: ipset_cmd = 3;
pub const ipset_cmd_IPSET_CMD_FLUSH: ipset_cmd = 4;
pub const ipset_cmd_IPSET_CMD_RENAME: ipset_cmd = 5;
pub const ipset_cmd_IPSET_CMD_SWAP: ipset_cmd = 6;
pub const ipset_cmd_IPSET_CMD_LIST: ipset_cmd = 7;
pub const ipset_cmd_IPSET_CMD_SAVE: ipset_cmd = 8;
pub const ipset_cmd_IPSET_CMD_ADD: ipset_cmd = 9;
pub const ipset_cmd_IPSET_CMD_DEL: ipset_cmd = 10;
pub const ipset_cmd_IPSET_CMD_TEST: ipset_cmd = 11;
pub const ipset_cmd_IPSET_CMD_HEADER: ipset_cmd = 12;
pub const ipset_cmd_IPSET_CMD_TYPE: ipset_cmd = 13;
pub const ipset_cmd_IPSET_CMD_GET_BYNAME: ipset_cmd = 14;
pub const ipset_cmd_IPSET_CMD_GET_BYINDEX: ipset_cmd = 15;
pub const ipset_cmd_IPSET_MSG_MAX: ipset_cmd = 16;
pub const ipset_cmd_IPSET_CMD_RESTORE: ipset_cmd = 16;
pub const ipset_cmd_IPSET_CMD_HELP: ipset_cmd = 17;
pub const ipset_cmd_IPSET_CMD_VERSION: ipset_cmd = 18;
pub const ipset_cmd_IPSET_CMD_QUIT: ipset_cmd = 19;
pub const ipset_cmd_IPSET_CMD_MAX: ipset_cmd = 20;
pub const ipset_cmd_IPSET_CMD_COMMIT: ipset_cmd = 20;
pub type ipset_cmd = ::std::os::raw::c_uint;
pub const IPSET_ATTR_UNSPEC: _bindgen_ty_1 = 0;
pub const IPSET_ATTR_PROTOCOL: _bindgen_ty_1 = 1;
pub const IPSET_ATTR_SETNAME: _bindgen_ty_1 = 2;
pub const IPSET_ATTR_TYPENAME: _bindgen_ty_1 = 3;
pub const IPSET_ATTR_SETNAME2: _bindgen_ty_1 = 3;
pub const IPSET_ATTR_REVISION: _bindgen_ty_1 = 4;
pub const IPSET_ATTR_FAMILY: _bindgen_ty_1 = 5;
pub const IPSET_ATTR_FLAGS: _bindgen_ty_1 = 6;
pub const IPSET_ATTR_DATA: _bindgen_ty_1 = 7;
pub const IPSET_ATTR_ADT: _bindgen_ty_1 = 8;
pub const IPSET_ATTR_LINENO: _bindgen_ty_1 = 9;
pub const IPSET_ATTR_PROTOCOL_MIN: _bindgen_ty_1 = 10;
pub const IPSET_ATTR_REVISION_MIN: _bindgen_ty_1 = 10;
pub const IPSET_ATTR_INDEX: _bindgen_ty_1 = 11;
pub const __IPSET_ATTR_CMD_MAX: _bindgen_ty_1 = 12;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const IPSET_ATTR_IP: _bindgen_ty_2 = 1;
pub const IPSET_ATTR_IP_FROM: _bindgen_ty_2 = 1;
pub const IPSET_ATTR_IP_TO: _bindgen_ty_2 = 2;
pub const IPSET_ATTR_CIDR: _bindgen_ty_2 = 3;
pub const IPSET_ATTR_PORT: _bindgen_ty_2 = 4;
pub const IPSET_ATTR_PORT_FROM: _bindgen_ty_2 = 4;
pub const IPSET_ATTR_PORT_TO: _bindgen_ty_2 = 5;
pub const IPSET_ATTR_TIMEOUT: _bindgen_ty_2 = 6;
pub const IPSET_ATTR_PROTO: _bindgen_ty_2 = 7;
pub const IPSET_ATTR_CADT_FLAGS: _bindgen_ty_2 = 8;
pub const IPSET_ATTR_CADT_LINENO: _bindgen_ty_2 = 9;
pub const IPSET_ATTR_MARK: _bindgen_ty_2 = 10;
pub const IPSET_ATTR_MARKMASK: _bindgen_ty_2 = 11;
pub const IPSET_ATTR_CADT_MAX: _bindgen_ty_2 = 16;
pub const IPSET_ATTR_INITVAL: _bindgen_ty_2 = 17;
pub const IPSET_ATTR_HASHSIZE: _bindgen_ty_2 = 18;
pub const IPSET_ATTR_MAXELEM: _bindgen_ty_2 = 19;
pub const IPSET_ATTR_NETMASK: _bindgen_ty_2 = 20;
pub const IPSET_ATTR_BUCKETSIZE: _bindgen_ty_2 = 21;
pub const IPSET_ATTR_RESIZE: _bindgen_ty_2 = 22;
pub const IPSET_ATTR_SIZE: _bindgen_ty_2 = 23;
pub const IPSET_ATTR_ELEMENTS: _bindgen_ty_2 = 24;
pub const IPSET_ATTR_REFERENCES: _bindgen_ty_2 = 25;
pub const IPSET_ATTR_MEMSIZE: _bindgen_ty_2 = 26;
pub const __IPSET_ATTR_CREATE_MAX: _bindgen_ty_2 = 27;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const IPSET_ATTR_ETHER: _bindgen_ty_3 = 17;
pub const IPSET_ATTR_NAME: _bindgen_ty_3 = 18;
pub const IPSET_ATTR_NAMEREF: _bindgen_ty_3 = 19;
pub const IPSET_ATTR_IP2: _bindgen_ty_3 = 20;
pub const IPSET_ATTR_CIDR2: _bindgen_ty_3 = 21;
pub const IPSET_ATTR_IP2_TO: _bindgen_ty_3 = 22;
pub const IPSET_ATTR_IFACE: _bindgen_ty_3 = 23;
pub const IPSET_ATTR_BYTES: _bindgen_ty_3 = 24;
pub const IPSET_ATTR_PACKETS: _bindgen_ty_3 = 25;
pub const IPSET_ATTR_COMMENT: _bindgen_ty_3 = 26;
pub const IPSET_ATTR_SKBMARK: _bindgen_ty_3 = 27;
pub const IPSET_ATTR_SKBPRIO: _bindgen_ty_3 = 28;
pub const IPSET_ATTR_SKBQUEUE: _bindgen_ty_3 = 29;
pub const IPSET_ATTR_PAD: _bindgen_ty_3 = 30;
pub const __IPSET_ATTR_ADT_MAX: _bindgen_ty_3 = 31;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const IPSET_ATTR_IPADDR_IPV4: _bindgen_ty_4 = 1;
pub const IPSET_ATTR_IPADDR_IPV6: _bindgen_ty_4 = 2;
pub const __IPSET_ATTR_IPADDR_MAX: _bindgen_ty_4 = 3;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const ipset_errno_IPSET_ERR_PRIVATE: ipset_errno = 4096;
pub const ipset_errno_IPSET_ERR_PROTOCOL: ipset_errno = 4097;
pub const ipset_errno_IPSET_ERR_FIND_TYPE: ipset_errno = 4098;
pub const ipset_errno_IPSET_ERR_MAX_SETS: ipset_errno = 4099;
pub const ipset_errno_IPSET_ERR_BUSY: ipset_errno = 4100;
pub const ipset_errno_IPSET_ERR_EXIST_SETNAME2: ipset_errno = 4101;
pub const ipset_errno_IPSET_ERR_TYPE_MISMATCH: ipset_errno = 4102;
pub const ipset_errno_IPSET_ERR_EXIST: ipset_errno = 4103;
pub const ipset_errno_IPSET_ERR_INVALID_CIDR: ipset_errno = 4104;
pub const ipset_errno_IPSET_ERR_INVALID_NETMASK: ipset_errno = 4105;
pub const ipset_errno_IPSET_ERR_INVALID_FAMILY: ipset_errno = 4106;
pub const ipset_errno_IPSET_ERR_TIMEOUT: ipset_errno = 4107;
pub const ipset_errno_IPSET_ERR_REFERENCED: ipset_errno = 4108;
pub const ipset_errno_IPSET_ERR_IPADDR_IPV4: ipset_errno = 4109;
pub const ipset_errno_IPSET_ERR_IPADDR_IPV6: ipset_errno = 4110;
pub const ipset_errno_IPSET_ERR_COUNTER: ipset_errno = 4111;
pub const ipset_errno_IPSET_ERR_COMMENT: ipset_errno = 4112;
pub const ipset_errno_IPSET_ERR_INVALID_MARKMASK: ipset_errno = 4113;
pub const ipset_errno_IPSET_ERR_SKBINFO: ipset_errno = 4114;
pub const ipset_errno_IPSET_ERR_TYPE_SPECIFIC: ipset_errno = 4352;
pub type ipset_errno = ::std::os::raw::c_uint;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_EXIST: ipset_cmd_flags = 0;
pub const ipset_cmd_flags_IPSET_FLAG_EXIST: ipset_cmd_flags = 1;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_LIST_SETNAME: ipset_cmd_flags = 1;
pub const ipset_cmd_flags_IPSET_FLAG_LIST_SETNAME: ipset_cmd_flags = 2;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_LIST_HEADER: ipset_cmd_flags = 2;
pub const ipset_cmd_flags_IPSET_FLAG_LIST_HEADER: ipset_cmd_flags = 4;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_SKIP_COUNTER_UPDATE: ipset_cmd_flags = 3;
pub const ipset_cmd_flags_IPSET_FLAG_SKIP_COUNTER_UPDATE: ipset_cmd_flags = 8;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_SKIP_SUBCOUNTER_UPDATE: ipset_cmd_flags = 4;
pub const ipset_cmd_flags_IPSET_FLAG_SKIP_SUBCOUNTER_UPDATE: ipset_cmd_flags = 16;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MATCH_COUNTERS: ipset_cmd_flags = 5;
pub const ipset_cmd_flags_IPSET_FLAG_MATCH_COUNTERS: ipset_cmd_flags = 32;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_RETURN_NOMATCH: ipset_cmd_flags = 7;
pub const ipset_cmd_flags_IPSET_FLAG_RETURN_NOMATCH: ipset_cmd_flags = 128;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MAP_SKBMARK: ipset_cmd_flags = 8;
pub const ipset_cmd_flags_IPSET_FLAG_MAP_SKBMARK: ipset_cmd_flags = 256;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MAP_SKBPRIO: ipset_cmd_flags = 9;
pub const ipset_cmd_flags_IPSET_FLAG_MAP_SKBPRIO: ipset_cmd_flags = 512;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MAP_SKBQUEUE: ipset_cmd_flags = 10;
pub const ipset_cmd_flags_IPSET_FLAG_MAP_SKBQUEUE: ipset_cmd_flags = 1024;
pub const ipset_cmd_flags_IPSET_FLAG_CMD_MAX: ipset_cmd_flags = 15;
pub type ipset_cmd_flags = ::std::os::raw::c_uint;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_BEFORE: ipset_cadt_flags = 0;
pub const ipset_cadt_flags_IPSET_FLAG_BEFORE: ipset_cadt_flags = 1;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_PHYSDEV: ipset_cadt_flags = 1;
pub const ipset_cadt_flags_IPSET_FLAG_PHYSDEV: ipset_cadt_flags = 2;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_NOMATCH: ipset_cadt_flags = 2;
pub const ipset_cadt_flags_IPSET_FLAG_NOMATCH: ipset_cadt_flags = 4;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_COUNTERS: ipset_cadt_flags = 3;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_COUNTERS: ipset_cadt_flags = 8;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_COMMENT: ipset_cadt_flags = 4;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_COMMENT: ipset_cadt_flags = 16;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_FORCEADD: ipset_cadt_flags = 5;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_FORCEADD: ipset_cadt_flags = 32;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_SKBINFO: ipset_cadt_flags = 6;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_SKBINFO: ipset_cadt_flags = 64;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_IFACE_WILDCARD: ipset_cadt_flags = 7;
pub const ipset_cadt_flags_IPSET_FLAG_IFACE_WILDCARD: ipset_cadt_flags = 128;
pub const ipset_cadt_flags_IPSET_FLAG_CADT_MAX: ipset_cadt_flags = 15;
pub type ipset_cadt_flags = ::std::os::raw::c_uint;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BIT_FORCEADD: ipset_create_flags = 0;
pub const ipset_create_flags_IPSET_CREATE_FLAG_FORCEADD: ipset_create_flags = 1;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BIT_BUCKETSIZE: ipset_create_flags = 1;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BUCKETSIZE: ipset_create_flags = 2;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BIT_MAX: ipset_create_flags = 7;
pub type ipset_create_flags = ::std::os::raw::c_uint;
pub const ipset_adt_IPSET_ADD: ipset_adt = 0;
pub const ipset_adt_IPSET_DEL: ipset_adt = 1;
pub const ipset_adt_IPSET_TEST: ipset_adt = 2;
pub const ipset_adt_IPSET_ADT_MAX: ipset_adt = 3;
pub const ipset_adt_IPSET_CREATE: ipset_adt = 3;
pub const ipset_adt_IPSET_CADT_MAX: ipset_adt = 4;
pub type ipset_adt = ::std::os::raw::c_uint;
pub type ip_set_id_t = __u16;
pub const ip_set_dim_IPSET_DIM_ZERO: ip_set_dim = 0;
pub const ip_set_dim_IPSET_DIM_ONE: ip_set_dim = 1;
pub const ip_set_dim_IPSET_DIM_TWO: ip_set_dim = 2;
pub const ip_set_dim_IPSET_DIM_THREE: ip_set_dim = 3;
pub const ip_set_dim_IPSET_DIM_MAX: ip_set_dim = 6;
pub const ip_set_dim_IPSET_BIT_RETURN_NOMATCH: ip_set_dim = 7;
pub type ip_set_dim = ::std::os::raw::c_uint;
pub const ip_set_kopt_IPSET_INV_MATCH: ip_set_kopt = 1;
pub const ip_set_kopt_IPSET_DIM_ONE_SRC: ip_set_kopt = 2;
pub const ip_set_kopt_IPSET_DIM_TWO_SRC: ip_set_kopt = 4;
pub const ip_set_kopt_IPSET_DIM_THREE_SRC: ip_set_kopt = 8;
pub const ip_set_kopt_IPSET_RETURN_NOMATCH: ip_set_kopt = 128;
pub type ip_set_kopt = ::std::os::raw::c_uint;
pub const IPSET_COUNTER_NONE: _bindgen_ty_5 = 0;
pub const IPSET_COUNTER_EQ: _bindgen_ty_5 = 1;
pub const IPSET_COUNTER_NE: _bindgen_ty_5 = 2;
pub const IPSET_COUNTER_LT: _bindgen_ty_5 = 3;
pub const IPSET_COUNTER_GT: _bindgen_ty_5 = 4;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_set_counter_match0 {
    pub op: __u8,
    pub value: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_set_counter_match0"][::std::mem::size_of::<ip_set_counter_match0>() - 16usize];
    ["Alignment of ip_set_counter_match0"]
        [::std::mem::align_of::<ip_set_counter_match0>() - 8usize];
    ["Offset of field: ip_set_counter_match0::op"]
        [::std::mem::offset_of!(ip_set_counter_match0, op) - 0usize];
    ["Offset of field: ip_set_counter_match0::value"]
        [::std::mem::offset_of!(ip_set_counter_match0, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_set_counter_match {
    pub value: __u64,
    pub op: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_set_counter_match"][::std::mem::size_of::<ip_set_counter_match>() - 16usize];
    ["Alignment of ip_set_counter_match"][::std::mem::align_of::<ip_set_counter_match>() - 8usize];
    ["Offset of field: ip_set_counter_match::value"]
        [::std::mem::offset_of!(ip_set_counter_match, value) - 0usize];
    ["Offset of field: ip_set_counter_match::op"]
        [::std::mem::offset_of!(ip_set_counter_match, op) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union ip_set_name_index {
    pub name: [::std::os::raw::c_char; 32usize],
    pub index: ip_set_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_set_name_index"][::std::mem::size_of::<ip_set_name_index>() - 32usize];
    ["Alignment of ip_set_name_index"][::std::mem::align_of::<ip_set_name_index>() - 2usize];
    ["Offset of field: ip_set_name_index::name"]
        [::std::mem::offset_of!(ip_set_name_index, name) - 0usize];
    ["Offset of field: ip_set_name_index::index"]
        [::std::mem::offset_of!(ip_set_name_index, index) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_set_req_get_set {
    pub op: ::std::os::raw::c_uint,
    pub version: ::std::os::raw::c_uint,
    pub set: ip_set_name_index,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_set_req_get_set"][::std::mem::size_of::<ip_set_req_get_set>() - 40usize];
    ["Alignment of ip_set_req_get_set"][::std::mem::align_of::<ip_set_req_get_set>() - 4usize];
    ["Offset of field: ip_set_req_get_set::op"]
        [::std::mem::offset_of!(ip_set_req_get_set, op) - 0usize];
    ["Offset of field: ip_set_req_get_set::version"]
        [::std::mem::offset_of!(ip_set_req_get_set, version) - 4usize];
    ["Offset of field: ip_set_req_get_set::set"]
        [::std::mem::offset_of!(ip_set_req_get_set, set) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_set_req_get_set_family {
    pub op: ::std::os::raw::c_uint,
    pub version: ::std::os::raw::c_uint,
    pub family: ::std::os::raw::c_uint,
    pub set: ip_set_name_index,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_set_req_get_set_family"]
        [::std::mem::size_of::<ip_set_req_get_set_family>() - 44usize];
    ["Alignment of ip_set_req_get_set_family"]
        [::std::mem::align_of::<ip_set_req_get_set_family>() - 4usize];
    ["Offset of field: ip_set_req_get_set_family::op"]
        [::std::mem::offset_of!(ip_set_req_get_set_family, op) - 0usize];
    ["Offset of field: ip_set_req_get_set_family::version"]
        [::std::mem::offset_of!(ip_set_req_get_set_family, version) - 4usize];
    ["Offset of field: ip_set_req_get_set_family::family"]
        [::std::mem::offset_of!(ip_set_req_get_set_family, family) - 8usize];
    ["Offset of field: ip_set_req_get_set_family::set"]
        [::std::mem::offset_of!(ip_set_req_get_set_family, set) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_set_req_version {
    pub op: ::std::os::raw::c_uint,
    pub version: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_set_req_version"][::std::mem::size_of::<ip_set_req_version>() - 8usize];
    ["Alignment of ip_set_req_version"][::std::mem::align_of::<ip_set_req_version>() - 4usize];
    ["Offset of field: ip_set_req_version::op"]
        [::std::mem::offset_of!(ip_set_req_version, op) - 0usize];
    ["Offset of field: ip_set_req_version::version"]
        [::std::mem::offset_of!(ip_set_req_version, version) - 4usize];
};
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_session {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_data {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn ipset_session_data(session: *const ipset_session) -> *mut ipset_data;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_handle {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn ipset_session_handle(session: *const ipset_session) -> *mut ipset_handle;
}
unsafe extern "C" {
    pub fn ipset_saved_type(session: *const ipset_session) -> *const ipset_type;
}
unsafe extern "C" {
    pub fn ipset_session_lineno(session: *mut ipset_session, lineno: u32);
}
unsafe extern "C" {
    pub fn ipset_session_printf_private(session: *mut ipset_session)
        -> *mut ::std::os::raw::c_void;
}
pub const ipset_err_type_IPSET_NO_ERROR: ipset_err_type = 0;
pub const ipset_err_type_IPSET_WARNING: ipset_err_type = 1;
pub const ipset_err_type_IPSET_NOTICE: ipset_err_type = 2;
pub const ipset_err_type_IPSET_ERROR: ipset_err_type = 3;
pub type ipset_err_type = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ipset_session_report(
        session: *mut ipset_session,
        type_: ipset_err_type,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_session_warning_as_error(session: *mut ipset_session) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_session_report_reset(session: *mut ipset_session);
}
unsafe extern "C" {
    pub fn ipset_session_report_msg(session: *const ipset_session)
        -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ipset_session_report_type(session: *const ipset_session) -> ipset_err_type;
}
pub const ipset_envopt_IPSET_ENV_BIT_SORTED: ipset_envopt = 0;
pub const ipset_envopt_IPSET_ENV_SORTED: ipset_envopt = 1;
pub const ipset_envopt_IPSET_ENV_BIT_QUIET: ipset_envopt = 1;
pub const ipset_envopt_IPSET_ENV_QUIET: ipset_envopt = 2;
pub const ipset_envopt_IPSET_ENV_BIT_RESOLVE: ipset_envopt = 2;
pub const ipset_envopt_IPSET_ENV_RESOLVE: ipset_envopt = 4;
pub const ipset_envopt_IPSET_ENV_BIT_EXIST: ipset_envopt = 3;
pub const ipset_envopt_IPSET_ENV_EXIST: ipset_envopt = 8;
pub const ipset_envopt_IPSET_ENV_BIT_LIST_SETNAME: ipset_envopt = 4;
pub const ipset_envopt_IPSET_ENV_LIST_SETNAME: ipset_envopt = 16;
pub const ipset_envopt_IPSET_ENV_BIT_LIST_HEADER: ipset_envopt = 5;
pub const ipset_envopt_IPSET_ENV_LIST_HEADER: ipset_envopt = 32;
pub type ipset_envopt = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ipset_envopt_test(session: *mut ipset_session, env: ipset_envopt) -> bool;
}
unsafe extern "C" {
    pub fn ipset_envopt_set(session: *mut ipset_session, env: ipset_envopt);
}
unsafe extern "C" {
    pub fn ipset_envopt_unset(session: *mut ipset_session, env: ipset_envopt);
}
pub const ipset_output_mode_IPSET_LIST_NONE: ipset_output_mode = 0;
pub const ipset_output_mode_IPSET_LIST_PLAIN: ipset_output_mode = 1;
pub const ipset_output_mode_IPSET_LIST_SAVE: ipset_output_mode = 2;
pub const ipset_output_mode_IPSET_LIST_XML: ipset_output_mode = 3;
pub type ipset_output_mode = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ipset_session_output(
        session: *mut ipset_session,
        mode: ipset_output_mode,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_commit(session: *mut ipset_session) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_cmd(
        session: *mut ipset_session,
        cmd: ipset_cmd,
        lineno: u32,
    ) -> ::std::os::raw::c_int;
}
pub type ipset_print_outfn = ::std::option::Option<
    unsafe extern "C" fn(
        session: *mut ipset_session,
        p: *mut ::std::os::raw::c_void,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn ipset_session_print_outfn(
        session: *mut ipset_session,
        outfn: ipset_print_outfn,
        p: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
pub const ipset_io_type_IPSET_IO_INPUT: ipset_io_type = 0;
pub const ipset_io_type_IPSET_IO_OUTPUT: ipset_io_type = 1;
pub type ipset_io_type = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ipset_session_io_full(
        session: *mut ipset_session,
        filename: *const ::std::os::raw::c_char,
        what: ipset_io_type,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_session_io_normal(
        session: *mut ipset_session,
        filename: *const ::std::os::raw::c_char,
        what: ipset_io_type,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_session_io_stream(session: *mut ipset_session, what: ipset_io_type) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ipset_session_io_close(
        session: *mut ipset_session,
        what: ipset_io_type,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_session_init(
        outfn: ipset_print_outfn,
        p: *mut ::std::os::raw::c_void,
    ) -> *mut ipset_session;
}
unsafe extern "C" {
    pub fn ipset_session_fini(session: *mut ipset_session) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_debug_msg(
        dir: *const ::std::os::raw::c_char,
        buffer: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    );
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub const ipset_keywords_IPSET_ARG_NONE: ipset_keywords = 0;
pub const ipset_keywords_IPSET_ARG_FAMILY: ipset_keywords = 1;
pub const ipset_keywords_IPSET_ARG_INET: ipset_keywords = 2;
pub const ipset_keywords_IPSET_ARG_INET6: ipset_keywords = 3;
pub const ipset_keywords_IPSET_ARG_HASHSIZE: ipset_keywords = 4;
pub const ipset_keywords_IPSET_ARG_MAXELEM: ipset_keywords = 5;
pub const ipset_keywords_IPSET_ARG_PROBES: ipset_keywords = 6;
pub const ipset_keywords_IPSET_ARG_RESIZE: ipset_keywords = 7;
pub const ipset_keywords_IPSET_ARG_GC: ipset_keywords = 8;
pub const ipset_keywords_IPSET_ARG_IGNORED_FROM: ipset_keywords = 9;
pub const ipset_keywords_IPSET_ARG_IGNORED_TO: ipset_keywords = 10;
pub const ipset_keywords_IPSET_ARG_IGNORED_NETWORK: ipset_keywords = 11;
pub const ipset_keywords_IPSET_ARG_SIZE: ipset_keywords = 12;
pub const ipset_keywords_IPSET_ARG_IPRANGE: ipset_keywords = 13;
pub const ipset_keywords_IPSET_ARG_NETMASK: ipset_keywords = 14;
pub const ipset_keywords_IPSET_ARG_PORTRANGE: ipset_keywords = 15;
pub const ipset_keywords_IPSET_ARG_BEFORE: ipset_keywords = 16;
pub const ipset_keywords_IPSET_ARG_AFTER: ipset_keywords = 17;
pub const ipset_keywords_IPSET_ARG_FROM_IP: ipset_keywords = 18;
pub const ipset_keywords_IPSET_ARG_TO_IP: ipset_keywords = 19;
pub const ipset_keywords_IPSET_ARG_NETWORK: ipset_keywords = 20;
pub const ipset_keywords_IPSET_ARG_FROM_PORT: ipset_keywords = 21;
pub const ipset_keywords_IPSET_ARG_TO_PORT: ipset_keywords = 22;
pub const ipset_keywords_IPSET_ARG_FORCEADD: ipset_keywords = 23;
pub const ipset_keywords_IPSET_ARG_MARKMASK: ipset_keywords = 24;
pub const ipset_keywords_IPSET_ARG_NOMATCH: ipset_keywords = 25;
pub const ipset_keywords_IPSET_ARG_IFACE_WILDCARD: ipset_keywords = 26;
pub const ipset_keywords_IPSET_ARG_TIMEOUT: ipset_keywords = 27;
pub const ipset_keywords_IPSET_ARG_COUNTERS: ipset_keywords = 28;
pub const ipset_keywords_IPSET_ARG_PACKETS: ipset_keywords = 29;
pub const ipset_keywords_IPSET_ARG_BYTES: ipset_keywords = 30;
pub const ipset_keywords_IPSET_ARG_COMMENT: ipset_keywords = 31;
pub const ipset_keywords_IPSET_ARG_ADT_COMMENT: ipset_keywords = 32;
pub const ipset_keywords_IPSET_ARG_SKBINFO: ipset_keywords = 33;
pub const ipset_keywords_IPSET_ARG_SKBMARK: ipset_keywords = 34;
pub const ipset_keywords_IPSET_ARG_SKBPRIO: ipset_keywords = 35;
pub const ipset_keywords_IPSET_ARG_SKBQUEUE: ipset_keywords = 36;
pub const ipset_keywords_IPSET_ARG_BUCKETSIZE: ipset_keywords = 37;
pub const ipset_keywords_IPSET_ARG_INITVAL: ipset_keywords = 38;
pub const ipset_keywords_IPSET_ARG_MAX: ipset_keywords = 39;
pub type ipset_keywords = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ipset_keyword(i: ipset_keywords) -> *const ipset_arg;
}
unsafe extern "C" {
    pub fn ipset_ignored_optname(opt: ::std::os::raw::c_uint) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_storage"][::std::mem::size_of::<sockaddr_storage>() - 128usize];
    ["Alignment of sockaddr_storage"][::std::mem::align_of::<sockaddr_storage>() - 8usize];
    ["Offset of field: sockaddr_storage::ss_family"]
        [::std::mem::offset_of!(sockaddr_storage, ss_family) - 0usize];
    ["Offset of field: sockaddr_storage::__ss_padding"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_padding) - 2usize];
    ["Offset of field: sockaddr_storage::__ss_align"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_align) - 120usize];
};
pub const MSG_OOB: _bindgen_ty_6 = 1;
pub const MSG_PEEK: _bindgen_ty_6 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_6 = 4;
pub const MSG_CTRUNC: _bindgen_ty_6 = 8;
pub const MSG_PROXY: _bindgen_ty_6 = 16;
pub const MSG_TRUNC: _bindgen_ty_6 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_6 = 64;
pub const MSG_EOR: _bindgen_ty_6 = 128;
pub const MSG_WAITALL: _bindgen_ty_6 = 256;
pub const MSG_FIN: _bindgen_ty_6 = 512;
pub const MSG_SYN: _bindgen_ty_6 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_6 = 2048;
pub const MSG_RST: _bindgen_ty_6 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_6 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_6 = 16384;
pub const MSG_MORE: _bindgen_ty_6 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_6 = 65536;
pub const MSG_BATCH: _bindgen_ty_6 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_6 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_6 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_6 = 1073741824;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msghdr"][::std::mem::size_of::<msghdr>() - 56usize];
    ["Alignment of msghdr"][::std::mem::align_of::<msghdr>() - 8usize];
    ["Offset of field: msghdr::msg_name"][::std::mem::offset_of!(msghdr, msg_name) - 0usize];
    ["Offset of field: msghdr::msg_namelen"][::std::mem::offset_of!(msghdr, msg_namelen) - 8usize];
    ["Offset of field: msghdr::msg_iov"][::std::mem::offset_of!(msghdr, msg_iov) - 16usize];
    ["Offset of field: msghdr::msg_iovlen"][::std::mem::offset_of!(msghdr, msg_iovlen) - 24usize];
    ["Offset of field: msghdr::msg_control"][::std::mem::offset_of!(msghdr, msg_control) - 32usize];
    ["Offset of field: msghdr::msg_controllen"]
        [::std::mem::offset_of!(msghdr, msg_controllen) - 40usize];
    ["Offset of field: msghdr::msg_flags"][::std::mem::offset_of!(msghdr, msg_flags) - 48usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cmsghdr"][::std::mem::size_of::<cmsghdr>() - 16usize];
    ["Alignment of cmsghdr"][::std::mem::align_of::<cmsghdr>() - 8usize];
    ["Offset of field: cmsghdr::cmsg_len"][::std::mem::offset_of!(cmsghdr, cmsg_len) - 0usize];
    ["Offset of field: cmsghdr::cmsg_level"][::std::mem::offset_of!(cmsghdr, cmsg_level) - 8usize];
    ["Offset of field: cmsghdr::cmsg_type"][::std::mem::offset_of!(cmsghdr, cmsg_type) - 12usize];
    ["Offset of field: cmsghdr::__cmsg_data"]
        [::std::mem::offset_of!(cmsghdr, __cmsg_data) - 16usize];
};
unsafe extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of linger"][::std::mem::size_of::<linger>() - 8usize];
    ["Alignment of linger"][::std::mem::align_of::<linger>() - 4usize];
    ["Offset of field: linger::l_onoff"][::std::mem::offset_of!(linger, l_onoff) - 0usize];
    ["Offset of field: linger::l_linger"][::std::mem::offset_of!(linger, l_linger) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osockaddr"][::std::mem::size_of::<osockaddr>() - 16usize];
    ["Alignment of osockaddr"][::std::mem::align_of::<osockaddr>() - 2usize];
    ["Offset of field: osockaddr::sa_family"]
        [::std::mem::offset_of!(osockaddr, sa_family) - 0usize];
    ["Offset of field: osockaddr::sa_data"][::std::mem::offset_of!(osockaddr, sa_data) - 2usize];
};
pub const SHUT_RD: _bindgen_ty_8 = 0;
pub const SHUT_WR: _bindgen_ty_8 = 1;
pub const SHUT_RDWR: _bindgen_ty_8 = 2;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_opts"][::std::mem::size_of::<ip_opts>() - 44usize];
    ["Alignment of ip_opts"][::std::mem::align_of::<ip_opts>() - 4usize];
    ["Offset of field: ip_opts::ip_dst"][::std::mem::offset_of!(ip_opts, ip_dst) - 0usize];
    ["Offset of field: ip_opts::ip_opts"][::std::mem::offset_of!(ip_opts, ip_opts) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreqn"][::std::mem::size_of::<ip_mreqn>() - 12usize];
    ["Alignment of ip_mreqn"][::std::mem::align_of::<ip_mreqn>() - 4usize];
    ["Offset of field: ip_mreqn::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreqn, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreqn::imr_address"]
        [::std::mem::offset_of!(ip_mreqn, imr_address) - 4usize];
    ["Offset of field: ip_mreqn::imr_ifindex"]
        [::std::mem::offset_of!(ip_mreqn, imr_ifindex) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_pktinfo"][::std::mem::size_of::<in_pktinfo>() - 12usize];
    ["Alignment of in_pktinfo"][::std::mem::align_of::<in_pktinfo>() - 4usize];
    ["Offset of field: in_pktinfo::ipi_ifindex"]
        [::std::mem::offset_of!(in_pktinfo, ipi_ifindex) - 0usize];
    ["Offset of field: in_pktinfo::ipi_spec_dst"]
        [::std::mem::offset_of!(in_pktinfo, ipi_spec_dst) - 4usize];
    ["Offset of field: in_pktinfo::ipi_addr"]
        [::std::mem::offset_of!(in_pktinfo, ipi_addr) - 8usize];
};
pub const IPPROTO_IP: _bindgen_ty_9 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_9 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_9 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_9 = 4;
pub const IPPROTO_TCP: _bindgen_ty_9 = 6;
pub const IPPROTO_EGP: _bindgen_ty_9 = 8;
pub const IPPROTO_PUP: _bindgen_ty_9 = 12;
pub const IPPROTO_UDP: _bindgen_ty_9 = 17;
pub const IPPROTO_IDP: _bindgen_ty_9 = 22;
pub const IPPROTO_TP: _bindgen_ty_9 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_9 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_9 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_9 = 46;
pub const IPPROTO_GRE: _bindgen_ty_9 = 47;
pub const IPPROTO_ESP: _bindgen_ty_9 = 50;
pub const IPPROTO_AH: _bindgen_ty_9 = 51;
pub const IPPROTO_MTP: _bindgen_ty_9 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_9 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_9 = 98;
pub const IPPROTO_PIM: _bindgen_ty_9 = 103;
pub const IPPROTO_COMP: _bindgen_ty_9 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_9 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_9 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_9 = 137;
pub const IPPROTO_ETHERNET: _bindgen_ty_9 = 143;
pub const IPPROTO_RAW: _bindgen_ty_9 = 255;
pub const IPPROTO_MPTCP: _bindgen_ty_9 = 262;
pub const IPPROTO_MAX: _bindgen_ty_9 = 263;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const IPPROTO_HOPOPTS: _bindgen_ty_10 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_10 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_10 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_10 = 58;
pub const IPPROTO_NONE: _bindgen_ty_10 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_10 = 60;
pub const IPPROTO_MH: _bindgen_ty_10 = 135;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub type in_port_t = u16;
pub const IPPORT_ECHO: _bindgen_ty_11 = 7;
pub const IPPORT_DISCARD: _bindgen_ty_11 = 9;
pub const IPPORT_SYSTAT: _bindgen_ty_11 = 11;
pub const IPPORT_DAYTIME: _bindgen_ty_11 = 13;
pub const IPPORT_NETSTAT: _bindgen_ty_11 = 15;
pub const IPPORT_FTP: _bindgen_ty_11 = 21;
pub const IPPORT_TELNET: _bindgen_ty_11 = 23;
pub const IPPORT_SMTP: _bindgen_ty_11 = 25;
pub const IPPORT_TIMESERVER: _bindgen_ty_11 = 37;
pub const IPPORT_NAMESERVER: _bindgen_ty_11 = 42;
pub const IPPORT_WHOIS: _bindgen_ty_11 = 43;
pub const IPPORT_MTP: _bindgen_ty_11 = 57;
pub const IPPORT_TFTP: _bindgen_ty_11 = 69;
pub const IPPORT_RJE: _bindgen_ty_11 = 77;
pub const IPPORT_FINGER: _bindgen_ty_11 = 79;
pub const IPPORT_TTYLINK: _bindgen_ty_11 = 87;
pub const IPPORT_SUPDUP: _bindgen_ty_11 = 95;
pub const IPPORT_EXECSERVER: _bindgen_ty_11 = 512;
pub const IPPORT_LOGINSERVER: _bindgen_ty_11 = 513;
pub const IPPORT_CMDSERVER: _bindgen_ty_11 = 514;
pub const IPPORT_EFSSERVER: _bindgen_ty_11 = 520;
pub const IPPORT_BIFFUDP: _bindgen_ty_11 = 512;
pub const IPPORT_WHOSERVER: _bindgen_ty_11 = 513;
pub const IPPORT_ROUTESERVER: _bindgen_ty_11 = 520;
pub const IPPORT_RESERVED: _bindgen_ty_11 = 1024;
pub const IPPORT_USERRESERVED: _bindgen_ty_11 = 5000;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__in6_u"][::std::mem::offset_of!(in6_addr, __in6_u) - 0usize];
};
unsafe extern "C" {
    pub static in6addr_any: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
    ["Alignment of sockaddr_in"][::std::mem::align_of::<sockaddr_in>() - 4usize];
    ["Offset of field: sockaddr_in::sin_family"]
        [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
    ["Offset of field: sockaddr_in::sin_port"]
        [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
    ["Offset of field: sockaddr_in::sin_addr"]
        [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
    ["Offset of field: sockaddr_in::sin_zero"]
        [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in6"][::std::mem::size_of::<sockaddr_in6>() - 28usize];
    ["Alignment of sockaddr_in6"][::std::mem::align_of::<sockaddr_in6>() - 4usize];
    ["Offset of field: sockaddr_in6::sin6_family"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_family) - 0usize];
    ["Offset of field: sockaddr_in6::sin6_port"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_port) - 2usize];
    ["Offset of field: sockaddr_in6::sin6_flowinfo"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_flowinfo) - 4usize];
    ["Offset of field: sockaddr_in6::sin6_addr"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_addr) - 8usize];
    ["Offset of field: sockaddr_in6::sin6_scope_id"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_scope_id) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq"][::std::mem::size_of::<ip_mreq>() - 8usize];
    ["Alignment of ip_mreq"][::std::mem::align_of::<ip_mreq>() - 4usize];
    ["Offset of field: ip_mreq::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq::imr_interface"]
        [::std::mem::offset_of!(ip_mreq, imr_interface) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq_source"][::std::mem::size_of::<ip_mreq_source>() - 12usize];
    ["Alignment of ip_mreq_source"][::std::mem::align_of::<ip_mreq_source>() - 4usize];
    ["Offset of field: ip_mreq_source::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq_source::imr_interface"]
        [::std::mem::offset_of!(ip_mreq_source, imr_interface) - 4usize];
    ["Offset of field: ip_mreq_source::imr_sourceaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_sourceaddr) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipv6_mreq"][::std::mem::size_of::<ipv6_mreq>() - 20usize];
    ["Alignment of ipv6_mreq"][::std::mem::align_of::<ipv6_mreq>() - 4usize];
    ["Offset of field: ipv6_mreq::ipv6mr_multiaddr"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_multiaddr) - 0usize];
    ["Offset of field: ipv6_mreq::ipv6mr_interface"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_interface) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_req"][::std::mem::size_of::<group_req>() - 136usize];
    ["Alignment of group_req"][::std::mem::align_of::<group_req>() - 8usize];
    ["Offset of field: group_req::gr_interface"]
        [::std::mem::offset_of!(group_req, gr_interface) - 0usize];
    ["Offset of field: group_req::gr_group"][::std::mem::offset_of!(group_req, gr_group) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_source_req"][::std::mem::size_of::<group_source_req>() - 264usize];
    ["Alignment of group_source_req"][::std::mem::align_of::<group_source_req>() - 8usize];
    ["Offset of field: group_source_req::gsr_interface"]
        [::std::mem::offset_of!(group_source_req, gsr_interface) - 0usize];
    ["Offset of field: group_source_req::gsr_group"]
        [::std::mem::offset_of!(group_source_req, gsr_group) - 8usize];
    ["Offset of field: group_source_req::gsr_source"]
        [::std::mem::offset_of!(group_source_req, gsr_source) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_msfilter"][::std::mem::size_of::<ip_msfilter>() - 20usize];
    ["Alignment of ip_msfilter"][::std::mem::align_of::<ip_msfilter>() - 4usize];
    ["Offset of field: ip_msfilter::imsf_multiaddr"]
        [::std::mem::offset_of!(ip_msfilter, imsf_multiaddr) - 0usize];
    ["Offset of field: ip_msfilter::imsf_interface"]
        [::std::mem::offset_of!(ip_msfilter, imsf_interface) - 4usize];
    ["Offset of field: ip_msfilter::imsf_fmode"]
        [::std::mem::offset_of!(ip_msfilter, imsf_fmode) - 8usize];
    ["Offset of field: ip_msfilter::imsf_numsrc"]
        [::std::mem::offset_of!(ip_msfilter, imsf_numsrc) - 12usize];
    ["Offset of field: ip_msfilter::imsf_slist"]
        [::std::mem::offset_of!(ip_msfilter, imsf_slist) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_filter"][::std::mem::size_of::<group_filter>() - 272usize];
    ["Alignment of group_filter"][::std::mem::align_of::<group_filter>() - 8usize];
    ["Offset of field: group_filter::gf_interface"]
        [::std::mem::offset_of!(group_filter, gf_interface) - 0usize];
    ["Offset of field: group_filter::gf_group"]
        [::std::mem::offset_of!(group_filter, gf_group) - 8usize];
    ["Offset of field: group_filter::gf_fmode"]
        [::std::mem::offset_of!(group_filter, gf_fmode) - 136usize];
    ["Offset of field: group_filter::gf_numsrc"]
        [::std::mem::offset_of!(group_filter, gf_numsrc) - 140usize];
    ["Offset of field: group_filter::gf_slist"]
        [::std::mem::offset_of!(group_filter, gf_slist) - 144usize];
};
unsafe extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union nf_inet_addr {
    pub all: [u32; 4usize],
    pub ip: u32,
    pub ip6: [u32; 4usize],
    pub in_: in_addr,
    pub in6: in6_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nf_inet_addr"][::std::mem::size_of::<nf_inet_addr>() - 16usize];
    ["Alignment of nf_inet_addr"][::std::mem::align_of::<nf_inet_addr>() - 4usize];
    ["Offset of field: nf_inet_addr::all"][::std::mem::offset_of!(nf_inet_addr, all) - 0usize];
    ["Offset of field: nf_inet_addr::ip"][::std::mem::offset_of!(nf_inet_addr, ip) - 0usize];
    ["Offset of field: nf_inet_addr::ip6"][::std::mem::offset_of!(nf_inet_addr, ip6) - 0usize];
    ["Offset of field: nf_inet_addr::in_"][::std::mem::offset_of!(nf_inet_addr, in_) - 0usize];
    ["Offset of field: nf_inet_addr::in6"][::std::mem::offset_of!(nf_inet_addr, in6) - 0usize];
};
pub const ipset_opt_IPSET_OPT_NONE: ipset_opt = 0;
pub const ipset_opt_IPSET_SETNAME: ipset_opt = 1;
pub const ipset_opt_IPSET_OPT_TYPENAME: ipset_opt = 2;
pub const ipset_opt_IPSET_OPT_FAMILY: ipset_opt = 3;
pub const ipset_opt_IPSET_OPT_IP: ipset_opt = 4;
pub const ipset_opt_IPSET_OPT_IP_FROM: ipset_opt = 4;
pub const ipset_opt_IPSET_OPT_IP_TO: ipset_opt = 5;
pub const ipset_opt_IPSET_OPT_CIDR: ipset_opt = 6;
pub const ipset_opt_IPSET_OPT_MARK: ipset_opt = 7;
pub const ipset_opt_IPSET_OPT_PORT: ipset_opt = 8;
pub const ipset_opt_IPSET_OPT_PORT_FROM: ipset_opt = 8;
pub const ipset_opt_IPSET_OPT_PORT_TO: ipset_opt = 9;
pub const ipset_opt_IPSET_OPT_TIMEOUT: ipset_opt = 10;
pub const ipset_opt_IPSET_OPT_GC: ipset_opt = 11;
pub const ipset_opt_IPSET_OPT_HASHSIZE: ipset_opt = 12;
pub const ipset_opt_IPSET_OPT_MAXELEM: ipset_opt = 13;
pub const ipset_opt_IPSET_OPT_MARKMASK: ipset_opt = 14;
pub const ipset_opt_IPSET_OPT_NETMASK: ipset_opt = 15;
pub const ipset_opt_IPSET_OPT_PROBES: ipset_opt = 16;
pub const ipset_opt_IPSET_OPT_RESIZE: ipset_opt = 17;
pub const ipset_opt_IPSET_OPT_SIZE: ipset_opt = 18;
pub const ipset_opt_IPSET_OPT_FORCEADD: ipset_opt = 19;
pub const ipset_opt_IPSET_OPT_ELEMENTS: ipset_opt = 20;
pub const ipset_opt_IPSET_OPT_REFERENCES: ipset_opt = 21;
pub const ipset_opt_IPSET_OPT_MEMSIZE: ipset_opt = 22;
pub const ipset_opt_IPSET_OPT_ETHER: ipset_opt = 23;
pub const ipset_opt_IPSET_OPT_NAME: ipset_opt = 24;
pub const ipset_opt_IPSET_OPT_NAMEREF: ipset_opt = 25;
pub const ipset_opt_IPSET_OPT_IP2: ipset_opt = 26;
pub const ipset_opt_IPSET_OPT_CIDR2: ipset_opt = 27;
pub const ipset_opt_IPSET_OPT_IP2_TO: ipset_opt = 28;
pub const ipset_opt_IPSET_OPT_PROTO: ipset_opt = 29;
pub const ipset_opt_IPSET_OPT_IFACE: ipset_opt = 30;
pub const ipset_opt_IPSET_OPT_SETNAME2: ipset_opt = 31;
pub const ipset_opt_IPSET_OPT_EXIST: ipset_opt = 32;
pub const ipset_opt_IPSET_OPT_BEFORE: ipset_opt = 33;
pub const ipset_opt_IPSET_OPT_PHYSDEV: ipset_opt = 34;
pub const ipset_opt_IPSET_OPT_NOMATCH: ipset_opt = 35;
pub const ipset_opt_IPSET_OPT_COUNTERS: ipset_opt = 36;
pub const ipset_opt_IPSET_OPT_PACKETS: ipset_opt = 37;
pub const ipset_opt_IPSET_OPT_BYTES: ipset_opt = 38;
pub const ipset_opt_IPSET_OPT_CREATE_COMMENT: ipset_opt = 39;
pub const ipset_opt_IPSET_OPT_ADT_COMMENT: ipset_opt = 40;
pub const ipset_opt_IPSET_OPT_SKBINFO: ipset_opt = 41;
pub const ipset_opt_IPSET_OPT_SKBMARK: ipset_opt = 42;
pub const ipset_opt_IPSET_OPT_SKBPRIO: ipset_opt = 43;
pub const ipset_opt_IPSET_OPT_SKBQUEUE: ipset_opt = 44;
pub const ipset_opt_IPSET_OPT_IFACE_WILDCARD: ipset_opt = 45;
pub const ipset_opt_IPSET_OPT_BUCKETSIZE: ipset_opt = 46;
pub const ipset_opt_IPSET_OPT_INITVAL: ipset_opt = 47;
pub const ipset_opt_IPSET_OPT_FLAGS: ipset_opt = 48;
pub const ipset_opt_IPSET_OPT_CADT_FLAGS: ipset_opt = 49;
pub const ipset_opt_IPSET_OPT_ELEM: ipset_opt = 50;
pub const ipset_opt_IPSET_OPT_TYPE: ipset_opt = 51;
pub const ipset_opt_IPSET_OPT_LINENO: ipset_opt = 52;
pub const ipset_opt_IPSET_OPT_REVISION: ipset_opt = 53;
pub const ipset_opt_IPSET_OPT_REVISION_MIN: ipset_opt = 54;
pub const ipset_opt_IPSET_OPT_INDEX: ipset_opt = 55;
pub const ipset_opt_IPSET_OPT_MAX: ipset_opt = 56;
pub type ipset_opt = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ipset_strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        len: usize,
    );
}
unsafe extern "C" {
    pub fn ipset_strlcat(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        len: usize,
    );
}
unsafe extern "C" {
    pub fn ipset_data_flags_test(data: *const ipset_data, flags: u64) -> bool;
}
unsafe extern "C" {
    pub fn ipset_data_flags_set(data: *mut ipset_data, flags: u64);
}
unsafe extern "C" {
    pub fn ipset_data_flags_unset(data: *mut ipset_data, flags: u64);
}
unsafe extern "C" {
    pub fn ipset_data_ignored(data: *mut ipset_data, opt: ipset_opt) -> bool;
}
unsafe extern "C" {
    pub fn ipset_data_test_ignored(data: *mut ipset_data, opt: ipset_opt) -> bool;
}
unsafe extern "C" {
    pub fn ipset_data_set(
        data: *mut ipset_data,
        opt: ipset_opt,
        value: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_data_get(data: *const ipset_data, opt: ipset_opt)
        -> *const ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ipset_data_setname(data: *const ipset_data) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ipset_data_family(data: *const ipset_data) -> u8;
}
unsafe extern "C" {
    pub fn ipset_data_cidr(data: *const ipset_data) -> u8;
}
unsafe extern "C" {
    pub fn ipset_data_flags(data: *const ipset_data) -> u64;
}
unsafe extern "C" {
    pub fn ipset_data_reset(data: *mut ipset_data);
}
unsafe extern "C" {
    pub fn ipset_data_init() -> *mut ipset_data;
}
unsafe extern "C" {
    pub fn ipset_data_fini(data: *mut ipset_data);
}
unsafe extern "C" {
    pub fn ipset_data_sizeof(opt: ipset_opt, family: u8) -> usize;
}
pub type ipset_parsefn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn ipset_parse_ether(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
        proto: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_mark(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_tcpudp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
        proto: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_tcp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_single_tcp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_proto(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_icmp(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_icmpv6(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_proto_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_tcp_udp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_family(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_ip(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_single_ip(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_net(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_range(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_netrange(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_iprange(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_ipnet(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_ip4_single6(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_ip4_net6(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_name(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_before(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_after(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_setname(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_timeout(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_uint64(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_uint32(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_uint16(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_uint8(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_netmask(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_flag(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_typename(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_iface(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_comment(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_skbmark(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_skbprio(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_ignored(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_elem(
        session: *mut ipset_session,
        optional: bool,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_call_parser(
        session: *mut ipset_session,
        arg: *const ipset_arg,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_iptimeout(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_name_compat(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub type ipset_printfn = ::std::option::Option<
    unsafe extern "C" fn(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn ipset_print_ether(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_family(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_type(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_ip(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_ipaddr(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_number(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_hexnumber(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_name(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_port(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_mark(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_iface(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_comment(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_skbmark(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_skbprio(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_proto(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_icmp(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_icmpv6(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_proto_port(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_flag(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_elem(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_print_data(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
pub const NFPROTO_UNSPEC: _bindgen_ty_12 = 0;
pub const NFPROTO_IPV4: _bindgen_ty_12 = 2;
pub const NFPROTO_ARP: _bindgen_ty_12 = 3;
pub const NFPROTO_BRIDGE: _bindgen_ty_12 = 7;
pub const NFPROTO_IPV6: _bindgen_ty_12 = 10;
pub const NFPROTO_DECNET: _bindgen_ty_12 = 12;
pub const NFPROTO_NUMPROTO: _bindgen_ty_12 = 13;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
pub const NFPROTO_IPSET_IPV46: _bindgen_ty_13 = 255;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
pub const IPSET_NO_ARG: _bindgen_ty_14 = -1;
pub const IPSET_OPTIONAL_ARG: _bindgen_ty_14 = 0;
pub const IPSET_MANDATORY_ARG: _bindgen_ty_14 = 1;
pub const IPSET_MANDATORY_ARG2: _bindgen_ty_14 = 2;
pub type _bindgen_ty_14 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_arg {
    pub name: [*const ::std::os::raw::c_char; 2usize],
    pub has_arg: ::std::os::raw::c_int,
    pub opt: ipset_opt,
    pub parse: ipset_parsefn,
    pub print: ipset_printfn,
    pub help: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipset_arg"][::std::mem::size_of::<ipset_arg>() - 48usize];
    ["Alignment of ipset_arg"][::std::mem::align_of::<ipset_arg>() - 8usize];
    ["Offset of field: ipset_arg::name"][::std::mem::offset_of!(ipset_arg, name) - 0usize];
    ["Offset of field: ipset_arg::has_arg"][::std::mem::offset_of!(ipset_arg, has_arg) - 16usize];
    ["Offset of field: ipset_arg::opt"][::std::mem::offset_of!(ipset_arg, opt) - 20usize];
    ["Offset of field: ipset_arg::parse"][::std::mem::offset_of!(ipset_arg, parse) - 24usize];
    ["Offset of field: ipset_arg::print"][::std::mem::offset_of!(ipset_arg, print) - 32usize];
    ["Offset of field: ipset_arg::help"][::std::mem::offset_of!(ipset_arg, help) - 40usize];
};
pub const IPSET_KERNEL_MISMATCH: _bindgen_ty_15 = -1;
pub const IPSET_KERNEL_CHECK_NEEDED: _bindgen_ty_15 = 0;
pub const IPSET_KERNEL_OK: _bindgen_ty_15 = 1;
pub type _bindgen_ty_15 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_elem {
    pub parse: ipset_parsefn,
    pub print: ipset_printfn,
    pub opt: ipset_opt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipset_elem"][::std::mem::size_of::<ipset_elem>() - 24usize];
    ["Alignment of ipset_elem"][::std::mem::align_of::<ipset_elem>() - 8usize];
    ["Offset of field: ipset_elem::parse"][::std::mem::offset_of!(ipset_elem, parse) - 0usize];
    ["Offset of field: ipset_elem::print"][::std::mem::offset_of!(ipset_elem, print) - 8usize];
    ["Offset of field: ipset_elem::opt"][::std::mem::offset_of!(ipset_elem, opt) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_optarg {
    pub args: [ipset_keywords; 24usize],
    pub need: u64,
    pub full: u64,
    pub help: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipset_optarg"][::std::mem::size_of::<ipset_optarg>() - 120usize];
    ["Alignment of ipset_optarg"][::std::mem::align_of::<ipset_optarg>() - 8usize];
    ["Offset of field: ipset_optarg::args"][::std::mem::offset_of!(ipset_optarg, args) - 0usize];
    ["Offset of field: ipset_optarg::need"][::std::mem::offset_of!(ipset_optarg, need) - 96usize];
    ["Offset of field: ipset_optarg::full"][::std::mem::offset_of!(ipset_optarg, full) - 104usize];
    ["Offset of field: ipset_optarg::help"][::std::mem::offset_of!(ipset_optarg, help) - 112usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct ipset_type {
    pub name: *const ::std::os::raw::c_char,
    pub revision: u8,
    pub family: u8,
    pub dimension: u8,
    pub kernel_check: i8,
    pub last_elem_optional: bool,
    pub elem: [ipset_elem; 3usize],
    pub compat_parse_elem: ipset_parsefn,
    pub cmd: [ipset_optarg; 4usize],
    pub usage: *const ::std::os::raw::c_char,
    pub usagefn: ::std::option::Option<unsafe extern "C" fn()>,
    pub description: *const ::std::os::raw::c_char,
    pub next: *mut ipset_type,
    pub alias: __IncompleteArrayField<*const ::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipset_type"][::std::mem::size_of::<ipset_type>() - 608usize];
    ["Alignment of ipset_type"][::std::mem::align_of::<ipset_type>() - 8usize];
    ["Offset of field: ipset_type::name"][::std::mem::offset_of!(ipset_type, name) - 0usize];
    ["Offset of field: ipset_type::revision"]
        [::std::mem::offset_of!(ipset_type, revision) - 8usize];
    ["Offset of field: ipset_type::family"][::std::mem::offset_of!(ipset_type, family) - 9usize];
    ["Offset of field: ipset_type::dimension"]
        [::std::mem::offset_of!(ipset_type, dimension) - 10usize];
    ["Offset of field: ipset_type::kernel_check"]
        [::std::mem::offset_of!(ipset_type, kernel_check) - 11usize];
    ["Offset of field: ipset_type::last_elem_optional"]
        [::std::mem::offset_of!(ipset_type, last_elem_optional) - 12usize];
    ["Offset of field: ipset_type::elem"][::std::mem::offset_of!(ipset_type, elem) - 16usize];
    ["Offset of field: ipset_type::compat_parse_elem"]
        [::std::mem::offset_of!(ipset_type, compat_parse_elem) - 88usize];
    ["Offset of field: ipset_type::cmd"][::std::mem::offset_of!(ipset_type, cmd) - 96usize];
    ["Offset of field: ipset_type::usage"][::std::mem::offset_of!(ipset_type, usage) - 576usize];
    ["Offset of field: ipset_type::usagefn"]
        [::std::mem::offset_of!(ipset_type, usagefn) - 584usize];
    ["Offset of field: ipset_type::description"]
        [::std::mem::offset_of!(ipset_type, description) - 592usize];
    ["Offset of field: ipset_type::next"][::std::mem::offset_of!(ipset_type, next) - 600usize];
    ["Offset of field: ipset_type::alias"][::std::mem::offset_of!(ipset_type, alias) - 608usize];
};
unsafe extern "C" {
    pub fn ipset_cache_add(
        name: *const ::std::os::raw::c_char,
        type_: *const ipset_type,
        family: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_cache_del(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_cache_rename(
        from: *const ::std::os::raw::c_char,
        to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_cache_swap(
        from: *const ::std::os::raw::c_char,
        to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_cache_init() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_cache_fini();
}
unsafe extern "C" {
    pub fn ipset_type_get(session: *mut ipset_session, cmd: ipset_cmd) -> *const ipset_type;
}
unsafe extern "C" {
    pub fn ipset_type_check(session: *mut ipset_session) -> *const ipset_type;
}
unsafe extern "C" {
    pub fn ipset_type_higher_rev(type_: *const ipset_type) -> *const ipset_type;
}
unsafe extern "C" {
    pub fn ipset_type_add(type_: *mut ipset_type) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_types() -> *const ipset_type;
}
unsafe extern "C" {
    pub fn ipset_typename_resolve(
        str_: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ipset_match_typename(str_: *const ::std::os::raw::c_char, t: *const ipset_type) -> bool;
}
unsafe extern "C" {
    pub fn ipset_load_types();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_commands {
    pub cmd: ipset_cmd,
    pub has_arg: ::std::os::raw::c_int,
    pub name: [*const ::std::os::raw::c_char; 3usize],
    pub help: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipset_commands"][::std::mem::size_of::<ipset_commands>() - 40usize];
    ["Alignment of ipset_commands"][::std::mem::align_of::<ipset_commands>() - 8usize];
    ["Offset of field: ipset_commands::cmd"][::std::mem::offset_of!(ipset_commands, cmd) - 0usize];
    ["Offset of field: ipset_commands::has_arg"]
        [::std::mem::offset_of!(ipset_commands, has_arg) - 4usize];
    ["Offset of field: ipset_commands::name"]
        [::std::mem::offset_of!(ipset_commands, name) - 8usize];
    ["Offset of field: ipset_commands::help"]
        [::std::mem::offset_of!(ipset_commands, help) - 32usize];
};
unsafe extern "C" {
    pub static ipset_commands: [ipset_commands; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_envopts {
    pub flag: ::std::os::raw::c_int,
    pub has_arg: ::std::os::raw::c_int,
    pub name: [*const ::std::os::raw::c_char; 2usize],
    pub help: *const ::std::os::raw::c_char,
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            ipset: *mut ipset,
            flag: ::std::os::raw::c_int,
            str_: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub print: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut ::std::os::raw::c_char,
            len: ::std::os::raw::c_uint,
            data: *const ipset_data,
            flag: ::std::os::raw::c_int,
            env: u8,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipset_envopts"][::std::mem::size_of::<ipset_envopts>() - 48usize];
    ["Alignment of ipset_envopts"][::std::mem::align_of::<ipset_envopts>() - 8usize];
    ["Offset of field: ipset_envopts::flag"][::std::mem::offset_of!(ipset_envopts, flag) - 0usize];
    ["Offset of field: ipset_envopts::has_arg"]
        [::std::mem::offset_of!(ipset_envopts, has_arg) - 4usize];
    ["Offset of field: ipset_envopts::name"][::std::mem::offset_of!(ipset_envopts, name) - 8usize];
    ["Offset of field: ipset_envopts::help"][::std::mem::offset_of!(ipset_envopts, help) - 24usize];
    ["Offset of field: ipset_envopts::parse"]
        [::std::mem::offset_of!(ipset_envopts, parse) - 32usize];
    ["Offset of field: ipset_envopts::print"]
        [::std::mem::offset_of!(ipset_envopts, print) - 40usize];
};
unsafe extern "C" {
    pub static ipset_envopts: [ipset_envopts; 0usize];
}
unsafe extern "C" {
    pub fn ipset_match_cmd(
        arg: *const ::std::os::raw::c_char,
        name: *const *const ::std::os::raw::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn ipset_match_option(
        arg: *const ::std::os::raw::c_char,
        name: *const *const ::std::os::raw::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn ipset_match_envopt(
        arg: *const ::std::os::raw::c_char,
        name: *const *const ::std::os::raw::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn ipset_port_usage();
}
unsafe extern "C" {
    pub fn ipset_parse_filename(
        ipset: *mut ipset,
        opt: ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_output(
        ipset: *mut ipset,
        opt: ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_envopt_parse(
        ipset: *mut ipset,
        env: ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub const ipset_exittype_IPSET_NO_PROBLEM: ipset_exittype = 0;
pub const ipset_exittype_IPSET_OTHER_PROBLEM: ipset_exittype = 1;
pub const ipset_exittype_IPSET_PARAMETER_PROBLEM: ipset_exittype = 2;
pub const ipset_exittype_IPSET_VERSION_PROBLEM: ipset_exittype = 3;
pub const ipset_exittype_IPSET_SESSION_PROBLEM: ipset_exittype = 4;
pub type ipset_exittype = ::std::os::raw::c_uint;
pub type ipset_custom_errorfn = ::std::option::Option<
    unsafe extern "C" fn(
        ipset: *mut ipset,
        p: *mut ::std::os::raw::c_void,
        status: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int,
>;
pub type ipset_standard_errorfn = ::std::option::Option<
    unsafe extern "C" fn(
        ipset: *mut ipset,
        p: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn ipset_session(ipset: *mut ipset) -> *mut ipset_session;
}
unsafe extern "C" {
    pub fn ipset_is_interactive(ipset: *mut ipset) -> bool;
}
unsafe extern "C" {
    pub fn ipset_custom_printf(
        ipset: *mut ipset,
        custom_error: ipset_custom_errorfn,
        standard_error: ipset_standard_errorfn,
        outfn: ipset_print_outfn,
        p: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_argv(
        ipset: *mut ipset,
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_line(
        ipset: *mut ipset,
        line: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_parse_stream(ipset: *mut ipset, f: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ipset_init() -> *mut ipset;
}
unsafe extern "C" {
    pub fn ipset_fini(ipset: *mut ipset) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn print_out(
        session: *mut ipset_session,
        p: *mut ::std::os::raw::c_void,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
